/****************************************************************************
* 文件名称 : 调试接口 主要面向 MATABLE 的数据接口
* 文件功能 : 实现 向 MATABLE 发送数据的接口等等 
* 注意事项 :
*****************************************************************************/

#include "Debug_.h"


/****************************************************************************
* 函数名称: 调试接口程序 
* 函数功能 : 实现 matable 的 相关接口 调试准备 工作
* 输入 :
* 输出 :
* 作者 :
*****************************************************************************/
void Debug_Interface(void)
{
#if Debug_Interface_Function == 1
	#warning "函数未重写"		/*!< 重写后请删除此段 */
#endif
}

